1CСпециалист_по_платформе/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ПартииНоменклатуры</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

1CСпециалист_по_платформе/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

1CСпециалист_по_платформе/src/AccumulationRegisters/ПартииНоменклатуры/ПартииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПартииНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

1CСпециалист_по_платформе/src/Documents/РасходнаяНакладная/ObjectModule.bsl
//БлокировкаДанных = Новый БлокировкаДанных;
//ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.ТоварыНаСкладах.НаборЗаписей");
//ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
//ЭлементБлокировки.УстановитьЗначение("Номенклатура", Номенклатура);
//ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
//БлокировкаДанных.Заблокировать();
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Движения.ПартииНоменклатуры.Записывать = Истина;

	Движения.ОстаткиНоменклатуры.Записать(Истина);
	Движения.ПартииНоменклатуры.Записать(Истина);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяСписокНоменклатуры.Количество КАК Количество
	|ИЗ
	|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
	|ГДЕ
	|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
	КонецЦикла;

	Движения.ОстаткиНоменклатуры.Записать(Истина);

	ПроверитьОстатки(Отказ);

	Если Не Отказ Тогда
		ПровестиПоПартиям(Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ПровестиПоПартиям(Отказ)

	ПорядокСписанияПартий = УчетнаяПолитика.ПорядокСписанияПартий(Дата);

	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
				   |	ПартииНоменклатурыОстатки.Номенклатура КАК Номенклатура,
				   |	ПартииНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток,
				   |	ПартииНоменклатурыОстатки.Партия.Дата КАК ДатаПартии,
				   |	ПартииНоменклатурыОстатки.СуммаОстаток КАК СуммаОстаток,
				   |	ПартииНоменклатурыОстатки.Партия КАК Партия
				   |ИЗ
				   |	РегистрНакопления.ПартииНоменклатуры.Остатки(&Граница, Номенклатура В (&Номенклатура)) КАК ПартииНоменклатурыОстатки
				   |ГДЕ
				   |	ПартииНоменклатурыОстатки.Номенклатура.ВидНоменклатуры <> &ВидНоменклатуры
				   |	И ПартииНоменклатурыОстатки.КоличествоОстаток > 0
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	Номенклатура,
				   |	ДатаПартии " + ?(ПорядокСписанияПартий = Перечисления.УчетнаяПолитика.ЛИФО, "УБЫВ", "") + "
																												  |ИТОГИ
																												  |	СУММА(КоличествоОстаток),
																												  |	СУММА(СуммаОстаток)
																												  |ПО
																												  |	Номенклатура";

	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", СписокНоменклатуры.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("ВидНоменклатуры", Перечисления.ВидыНоменклатуры.Услуга);
	Запрос.УстановитьПараметр("Граница", Новый Граница(Дата, ВидГраницы.Включая));

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ВыборкаПоНоменклатуре = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	тзТовары = СписокНоменклатуры.Выгрузить( , "Номенклатура,Количество");
	тзТовары.Свернуть("Номенклатура", "Количество");

	Для Каждого СтрТовары Из тзТовары Цикл
		Пока ВыборкаПоНоменклатуре.НайтиСледующий(Новый Структура("Номенклатура", СтрТовары.Номенклатура)) Цикл
			ВыборкаПоПартиям = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоПартиям.Следующий() Цикл

				КоличествоКСписанию = Мин(ВыборкаПоПартиям.КоличествоОстаток, СтрТовары.Количество);
				Если КоличествоКСписанию = ВыборкаПоПартиям.КоличествоОстаток Тогда
					СуммаКСписанию = ВыборкаПоПартиям.СуммаОстаток;
				Иначе
					СуммаКСписанию = КоличествоКСписанию * ВыборкаПоПартиям.СуммаОстаток
						/ ВыборкаПоПартиям.КоличествоОстаток;
				КонецЕсли;

				Движение = Движения.ПартииНоменклатуры.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Номенклатура = ВыборкаПоПартиям.Номенклатура;
				Движение.Партия = ВыборкаПоПартиям.Партия;
				Движение.Количество = КоличествоКСписанию;
				Движение.Сумма = СуммаКСписанию;

				СтрТовары.Количество = СтрТовары.Количество - КоличествоКСписанию;
			КонецЦикла;
		КонецЦикла;

		Если СтрТовары.Количество <> 0 Тогда
			Сообщить("В регистре партий недостаточно " + СтрТовары.Номенклатура);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;

	Если Не Отказ Тогда
		Движения.ОстаткиНоменклатуры.Записать(Истина);
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьОстатки(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстатки.Склад КАК Склад,
	|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
	|			&Граница,
	|			Склад = &Склад
	|				И Номенклатура В (&Номенклатура)) КАК ОстаткиНоменклатурыОстатки
	|ГДЕ
	|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0
	|	И ОстаткиНоменклатурыОстатки.Номенклатура.ВидНоменклатуры <> &ВидНоменклатуры
	|";

	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", СписокНоменклатуры.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("ВидНоменклатуры", Перечисления.ВидыНоменклатуры.Услуга);
	Запрос.УстановитьПараметр("Граница", Новый Граница(Дата, ВидГраницы.Включая));

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		Сообщить("В регистре остатков недостаточно " + Выборка.Номенклатура);
		Отказ = Истина;
	КонецЦикла;

КонецПроцедуры
